tpcds_conf/baidu-tpcds-yarn-throughput-allcores.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.8" jmeter="2.13 r1665067">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>

    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">9</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>

      <hashTree>
        <SwitchController guiclass="SwitchControllerGui" testclass="SwitchController" testname="Switch Controller" enabled="true">
          <stringProp name="SwitchController.value">${__jexl(${__threadNum} - 1)}</stringProp>
          <stringProp name="TestPlan.comments">One master per thread</stringProp>
        </SwitchController>
        <hashTree>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q19_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q19_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q43_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q43_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q63_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q63_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q42_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q42_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q52_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q52_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q55_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q55_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q68_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q68_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q73_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q73_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
          <org.apache.jmeter.protocol.ssh.sampler.SSHSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSampler" testname="q98_USER_tuned_2" enabled="true">
            <stringProp name="hostname">HOST</stringProp>
            <intProp name="port">22</intProp>
            <stringProp name="username">USER</stringProp>
            <stringProp name="password">PASSWD</stringProp>
            <stringProp name="command">SRCPATH/run_throughput_jmeter.sh q98_USER_tuned_2 </stringProp>
          </org.apache.jmeter.protocol.ssh.sampler.SSHSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <boolProp name="useGroupName">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
        <stringProp name="ConstantTimer.delay">60</stringProp>
      </ConstantTimer>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>